FROM node:20-alpine3.18

WORKDIR /app

WORKDIR /usr/src/app

# Копируйте файлы проекта в рабочую директорию контейнера
COPY . .

# Установите зависимости
# Вместо '*' вы можете указать конкретную версию Hardhat
RUN yarn add hardhat --dev


# Если у вас есть дополнительные зависимости, установите их здесь
# RUN npm install --save-dev @nomiclabs/hardhat-ethers ethers

# Скопируйте ваш скрипт для запуска Hardhat node, например, hardhat.config.js
# и другие необходимые файлы конфигурации
# Это предполагает, что вы уже скопировали все файлы проекта в предыдущем шаге

# Вы можете указать команду для запуска Hardhat node
# Это будет команда по умолчанию при запуске контейнера
CMD ["yarn", "hardhat", "node"]
